# RebarHookRotationAtStartSchedulesTagsFilters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarHookRotationAtStartSchedulesTagsFilters Property
ParameterTypeId Class See Also
---
"Hook Rotation At Start"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarHookRotationAtStartSchedulesTagsFilters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHookRotationAtStartSchedulesTagsFilters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarHookRotationAtStartSchedulesTagsFilters {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace